In [1]:
import numpy as np
import pandas as pd

In [2]:
date=pd.read_csv('orders.csv')
time=pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
#when we import data or time in pandas, by default the date and time column in it is in object(string) form
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

hence we need to convert it into date and time datatype/object

# Working with Dates:

In [7]:
#converting date dataframe to datetime object

In [8]:
date['date']=pd.to_datetime(date['date'])

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

## 1. Extracting year:

In [11]:
date['date_year']=date['date'].dt.year

date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

## 2. Extracting month:

In [13]:
date['date_month_no.']=date['date'].dt.month

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_no.
0,2019-12-10,5628,25,3,2019,12,12
1,2018-08-15,3646,14,157,2018,8,8
2,2018-10-23,1859,25,1,2018,10,10
3,2019-08-17,7292,25,1,2019,8,8
4,2019-01-06,4344,25,3,2019,1,1

In [25]:
date['date_month']=date['date'].dt.month_name()

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_no.,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,5628,25,3,2019,December,12,10,1,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,August,8,15,2,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,October,10,23,1,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,August,8,17,5,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,January,1,6,6,Sunday,1,1,1

In [26]:
#day of the month
date['date_day']=date['date'].dt.day

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_no.,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,5628,25,3,2019,December,12,10,1,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,August,8,15,2,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,October,10,23,1,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,August,8,17,5,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,January,1,6,6,Sunday,1,1,1

In [27]:
#day of the week
date['date_dow']=date['date'].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_no.,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,5628,25,3,2019,December,12,10,1,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,August,8,15,2,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,October,10,23,1,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,August,8,17,5,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,January,1,6,6,Sunday,1,1,1

In [28]:
#day of the week name:
date['date_dow_name']=date['date'].dt.day_name()

date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_no.,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,5628,25,3,2019,December,12,10,1,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,August,8,15,2,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,October,10,23,1,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,August,8,17,5,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,January,1,6,6,Sunday,1,1,1

In [29]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_no.,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,5628,25,3,2019,December,12,10,1,Tuesday,0,50,4
1,2018-08-15,3646,14,157,2018,August,8,15,2,Wednesday,0,33,3
2,2018-10-23,1859,25,1,2018,October,10,23,1,Tuesday,0,43,4
3,2019-08-17,7292,25,1,2019,August,8,17,5,Saturday,1,33,3
4,2019-01-06,4344,25,3,2019,January,1,6,6,Sunday,1,1,1

1️⃣ date['date_dow_name']
This column contains day names like
Monday, Tuesday, ..., Sunday


2️⃣ .isin(['Sunday', 'Saturday'])
Checks each row
Returns:
True → if the day is Sunday or Saturday
False → otherwise
Example:

Monday   → False
Saturday → True
Sunday   → True


3️⃣ np.where(condition, 1, 0)

Works like an if–else
Meaning:
If condition is True → put 1
If condition is False → put 0

Final result

A new column is created:

date_is_weekend
1 → Weekend (Saturday/Sunday)
0 → Weekday

## 3.Extracting week of the year:

In [30]:
date['date_week'] = date['date'].dt.isocalendar().week
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_no.,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,December,12,10,1,Tuesday,0,50,4
1,2018-08-15,2018,August,8,15,2,Wednesday,0,33,3
2,2018-10-23,2018,October,10,23,1,Tuesday,0,43,4
3,2019-08-17,2019,August,8,17,5,Saturday,1,33,3
4,2019-01-06,2019,January,1,6,6,Sunday,1,1,1

## 4. Extract Quarter:

In [31]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_no.,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,December,12,10,1,Tuesday,0,50,4
1,2018-08-15,2018,August,8,15,2,Wednesday,0,33,3
2,2018-10-23,2018,October,10,23,1,Tuesday,0,43,4
3,2019-08-17,2019,August,8,17,5,Saturday,1,33,3
4,2019-01-06,2019,January,1,6,6,Sunday,1,1,1

## 5.Extracting semester:

In [38]:
date['semester']=np.where(date['date'].dt.quarter.isin([1,2]),1,2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month,date_month_no.,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,December,12,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,August,8,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,October,10,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,August,8,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,January,1,6,6,Sunday,1,1,1,1

## 6.Extract time elapsed between two dates(important):

In [39]:
import datetime
today=datetime.datetime.today()
today

datetime.datetime(2026, 1, 14, 20, 52, 34, 237663)

In [40]:
today-date['date']

0     2227 days 20:52:34.237663
1     2709 days 20:52:34.237663
2     2640 days 20:52:34.237663
3     2342 days 20:52:34.237663
4     2565 days 20:52:34.237663
                 ...
995   2655 days 20:52:34.237663
996   2596 days 20:52:34.237663
997   2444 days 20:52:34.237663
998   2509 days 20:52:34.237663
999   2283 days 20:52:34.237663
Name: date, Length: 1000, dtype: timedelta64[ns]

In [41]:
(today - date['date']).dt.days

0      2227
1      2709
2      2640
3      2342
4      2565
       ...
995    2655
996    2596
997    2444
998    2509
999    2283
Name: date, Length: 1000, dtype: int64

In [43]:
# Months passed
#this one converts months to be 30days only
np.round((today - date['date']).dt.days / 30, 0)

0      74.0
1      90.0
2      88.0
3      78.0
4      86.0
       ...
995    88.0
996    87.0
997    81.0
998    84.0
999    76.0
Name: date, Length: 1000, dtype: float64

In [46]:
#months passed
#this one gives more accurate vaues
(today.year - date['date'].dt.year) * 12 + (today.month - date['date'].dt.month)

0      73
1      89
2      87
3      77
4      84
       ..
995    87
996    85
997    80
998    82
999    75
Name: date, Length: 1000, dtype: int32

# Working on time:

In [58]:

time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
 2   hour    1000 non-null   int32
 3   min     1000 non-null   int32
 4   sec     1000 non-null   int32
 5   time    1000 non-null   object
dtypes: datetime64[ns](1), int32(3), object(2)
memory usage: 35.3+ KB

In [59]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [60]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
 2   hour    1000 non-null   int32
 3   min     1000 non-null   int32
 4   sec     1000 non-null   int32
 5   time    1000 non-null   object
dtypes: datetime64[ns](1), int32(3), object(2)
memory usage: 35.3+ KB

In [61]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

## 7.Extracting time part:

In [62]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

### Time difference:

In [63]:
today - time['date']

0     4413 days 20:02:34.237663
1     4277 days 21:12:34.237663
2     4763 days 20:31:34.237663
3     4065 days 20:21:34.237663
4     4462 days 21:41:34.237663
                 ...
995   5052 days 20:02:34.237663
996   4373 days 21:38:34.237663
997   4838 days 21:15:34.237663
998   4954 days 21:18:34.237663
999   4226 days 21:27:34.237663
Name: date, Length: 1000, dtype: timedelta64[ns]

In [64]:
# in seconds
(today - time['date'])/np.timedelta64(1,'s')

0      3.813554e+08
1      3.696092e+08
2      4.115971e+08
3      3.512893e+08
4      3.855949e+08
           ...
995    4.365650e+08
996    3.779051e+08
997    4.180797e+08
998    4.281023e+08
999    3.652037e+08
Name: date, Length: 1000, dtype: float64

In [65]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      6.355923e+06
1      6.160153e+06
2      6.859952e+06
3      5.854822e+06
4      6.426582e+06
           ...
995    7.276083e+06
996    6.298419e+06
997    6.967996e+06
998    7.135039e+06
999    6.086728e+06
Name: date, Length: 1000, dtype: float64

In [66]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      105932.042844
1      102669.209510
2      114332.526177
3       97580.359510
4      107109.692844
           ...
995    121268.042844
996    104973.642844
997    116133.259510
998    118917.309510
999    101445.459510
Name: date, Length: 1000, dtype: float64